console.log(`Самооценка - 70 балла(ов)
Отзыв по пунктам ТЗ:
Выполненные пункты:
1) на странице есть несколько фото и строка поиска — 5 балл(а)
2) в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс — 5 балл(а)
3) При загрузке приложения на странице отображаются полученные от API изображения — 10 балл(а)
4) Если в поле поиска ввести слово и отправить поисковый запрос, на странице отобразятся изображения соответствующей тематики, если такие данные предоставляет API
5) при открытии приложения курсор находится в поле ввода — 5 балл(а)
6) есть placeholder — 5 балл(а)
7) автозаполнение поля ввода отключено (нет выпадающего списка с предыдущими запросами) — 5 балл(а)
8) поисковый запрос можно отправить нажатием клавиши Enter — 5 балл(а)
9) после отправки поискового запроса и отображения результатов поиска, поисковый запрос продолжает отображаться в поле ввода — 5 балл(а)
10) в поле ввода есть крестик при клике по которому поисковый запрос из поля ввода удаляется и отображается placeholder — 5 балл(а)
11) Очень высокое качество оформления приложения и дополнительный не предусмотренный в задании функционал (открытие картинки на весь экран), улучшающий качество приложения — 10 балл(а)
`);
